// data.js

export const registrationData = [
  {
    id: 'online',
    title: 'онлайн',
    icon: {
      path: '<svg xmlns="http://www.w3.org/2000/svg" width="13" height="15" fill="none"><path fill="#fff" d="m6.758 5.783 5.42 4.474a.907.907 0 0 1-.582 1.605H9.648a1.83 1.83 0 0 0-1.457.723l-1.173 1.553a.911.911 0 0 1-1.636-.501L5.04 6.636a1.045 1.045 0 0 1 1.718-.853M5.6 2.553V1.06a.56.56 0 1 0-1.12 0v1.493a.56.56 0 1 0 1.12 0M3.103 4.065a.56.56 0 0 0-.217-.765l-1.493-.833a.56.56 0 1 0-.546.978l1.494.833a.55.55 0 0 0 .762-.213M.81 7.535l1.494-.747a.56.56 0 1 0-.5-1.002L.31 6.533a.56.56 0 0 0 .5 1.002M8.277 3.8l1.494-.747a.56.56 0 0 0-.5-1.002L7.776 2.8a.56.56 0 0 0 .5 1.002"></path></svg>',
      width: 13,
      height: 15,
    },
    steps: [
      {
        number: 1,
        title: 'Выберите понравившийся тур на сайте',
        description: 'Воспользуйтесь поиском туров, задав необходимые параметры',
      },
      {
        number: 2,
        title: 'Онлайн оплата и СМС-подписание договора',
        description: 'Оплачивайте банковской картой и подписывайте договор, не выходя из дома. Используйте эту возможность, чтобы сэкономить время или успеть перехватить уникальный горящий тур.',
      },
      {
        number: 3,
        title: 'Получите все необходимые для путешествия документы на e-mail',
        description: 'Билет, ваучер, страховой полис и другие документы, необходимые для путешествия, вы получите в электронном виде по Email.',
      },
    ],
  },
  {
    id: 'office',
    title: 'в офисе',
    icon: {
      path: '<svg xmlns="http://www.w3.org/2000/svg" width="14" height="15" fill="none"><path fill="#fff" fill-rule="evenodd" d="M5.727.5h7.637a.64.64 0 0 1 .636.636v12.728a.64.64 0 0 1-.636.636h-1.91v-3.818a.64.64 0 0 0-.636-.636H8.273a.64.64 0 0 0-.637.636V14.5H5.091V1.136A.64.64 0 0 1 5.727.5M8.91 4.318a.636.636 0 1 1-1.273 0v-.636a.636.636 0 0 1 1.273 0zm2.36.45a.64.64 0 0 0 .185-.45v-.636a.636.636 0 1 0-1.272 0v.636a.637.637 0 0 0 1.086.45m.185 2.732a.636.636 0 1 1-1.272 0v-.636a.637.637 0 0 1 1.272 0zm-2.731.45a.64.64 0 0 0 .186-.45v-.636a.636.636 0 1 0-1.273 0V7.5a.636.636 0 0 0 1.087.45M0 13.864V4.318a.64.64 0 0 1 .636-.636h3.182V14.5H.636A.64.64 0 0 1 0 13.864m1.273-7a.636.636 0 1 1 1.272 0V7.5a.636.636 0 1 1-1.272 0zm.186 2.731a.64.64 0 0 0-.186.45v.637a.636.636 0 1 0 1.272 0v-.636a.636.636 0 0 0-1.086-.45" clip-rule="evenodd"></path></svg>',
      width: 14,
      height: 15,
    },
    steps: [
      {
        number: 1,
        title: 'Выберите удобный для вас офис',
        description: '12 офисов продаж во всех районах Санкт-Петербурга.',
      },
      {
        number: 2,
        title: 'Подбор оптимального тура вместе со специалистом',
        description: 'Наши менеджеры с радостью ответят на все ваши вопросы и помогут определиться с выбором.',
      },
      {
        number: 3,
        title: 'Оплата тура и подписание договора',
        description: 'Оплачивайте банковской картой, наличными или в рассрочку.',
      },
      {
        number: 4,
        title: 'Получите все необходимые для путешествия документы на e-mail',
        description: 'Билет, ваучер, страховой полис и другие документы, необходимые для путешествия, вы получите в электронном виде по Email.',
      },
    ],
  },
];